[
	{
		"title": "DuoTune",
		"description": "Duotune is a full-stack web app in its MVP phase, designed to connect producers and musicians seeking collaboration. Built using React, Flask, and SQLalchemy, it employs a Tinder-like interface for users to swipe right or left on profile cards featuring pictures, descriptions, user types, and audio snippets. Mutual swipes lead to chatroom pairing for further communication, with messaging managed on the Flask backend. The app supports profile updates, user authentication and authorization, and filters users based on preferences. The frontend utilizes Framer Motion, Three.js, and custom illustrations for interactive animations and graphic design.",
		"githubLink": "https://github.com/MadisonEvans94/Duotune",
		"siteLink": null,
		"videoLink": "src/assets/duotune.mov"
	},
	{
		"title": "Palette Pal",
		"description": "Palette Pal is a React-based web app that enables users to upload images and create color palettes by breaking down the image into its constituent pixels and projecting them into RGB color space. The app employs a K-means clustering algorithm to cluster similar pixels and generate a specified number of colors to represent the image. Users can select the number of colors they want in their palette and copy the corresponding hex codes for use in their design projects. The app runs entirely client-side, including the clustering algorithm, to ensure maximum performance. Palette Pal is an excellent tool for developers and designers who want to create color themes quickly based on images.",
		"githubLink": "https://github.com/MadisonEvans94/PalettePal",
		"siteLink": "https://palettepal.herokuapp.com/",
		"videoLink": "src/assets/palette.mp4"
	},
	{
		"title": "Blue Cloud Music",
		"description": "Blue Cloud Music is a personal music website that I created using React and Django. As an artist, producer, and audio engineer with over a decade of experience, I am incredibly proud of this project, which showcases my music and creative abilities. The site features captivating animations, UI, and other design principles that I poured my heart into during the development process. Through this site, I am able to connect with my fans and share my music with the world. In addition, I plan to sell sample packs and plugins that I'm currently working on. Blue Cloud Music is a creative venture that allows me to express myself musically and share my passion with others.",

		"githubLink": "https://github.com/MadisonEvans94/bluecloud-music",
		"siteLink": "https://bluecloudmusic.herokuapp.com",
		"videoLink": "src/assets/blue-cloud.mp4"
	},
	{
		"title": "Drop the Ball",
		"description": "Drop The Ball is an interactive game developed using Vanilla Javascript and HTML Canvas, featuring animation and physics simulation. The game involves dropping a ball into a virtual peg board where the ball adheres to gravity and bounces off the pegs. The physics simulation is implemented using mathematical equations to accurately simulate the ball's movement and collision with the pegs. The HTML canvas is used to render the game graphics and create the user interface. Overall, 'Drop The Ball' is a fun and engaging project that showcases the power of Vanilla Javascript and HTML Canvas for game development.",

		"githubLink": "https://github.com/MadisonEvans94/Drop-The-Ball",
		"siteLink": null,
		"videoLink": "src/assets/drop-the-ball.mp4"
	}
]
